AhmedAdel21/Embedded-Software/8051/Digital Filtering using C8051F020/electronics/DIO.c
	

#include <c8051f020.h>
#include "std_macros.h"
#include "DIO.h"


void DIO_setPin_OutPutMode(unsigned char portnumber,unsigned char pinnumber,unsigned char direction)
{
		switch(portnumber)
	{
			case 0:
			if(direction==1)
			{
				SET_BIT(P0MDOUT,pinnumber);//Set the output mode of port0 to Push-Pull mode
			}
			else
			{
				CLR_BIT(P0MDOUT,pinnumber);//Set the output mode of port0 to Open-Drain mode
			}
		  break;

		case 1:
			if(direction==1)
			{
				SET_BIT(P1MDOUT,pinnumber);//Set the output mode of port0 to Push-Pull mode
			}
			else
			{
				CLR_BIT(P1MDOUT,pinnumber);//Set the output mode of port0 to Open-Drain mode
			}
			break;

		case 2:
			if(direction==1)
			{
				SET_BIT(P2MDOUT,pinnumber);//Set the output mode of port0 to Push-Pull mode
			}
			else
			{
				CLR_BIT(P2MDOUT,pinnumber);//Set the output mode of port0 to Open-Drain mode
			}
			break;
			
		case 3:
			if(direction==1)
			{
				SET_BIT(P3MDOUT,pinnumber);//Set the output mode of port0 to Push-Pull mode
			}
			else
			{
				CLR_BIT(P3MDOUT,pinnumber);//Set the output mode of port0 to Open-Drain mode
			}
			break;
		default: 
		break;

}
	}

void DIO_pinWrite(unsigned char portnumber,unsigned char pinnumber,unsigned char outputvalue)
{
	switch(portnumber)
	{
		case 0:
			if(outputvalue==1)
			{
				SET_BIT(P0,pinnumber);//Set the value of the given pin in port0 as High
			}
			else
			{
				CLR_BIT(P0,pinnumber);//Set the value of the given pin in port0 as Low
			}
			break ;
		
		case 1:
			if(outputvalue==1)
			{
				SET_BIT(P1,pinnumber);//Set the value of the given pin in port1 as High
			}
			else
			{
				CLR_BIT(P1,pinnumber);//Set the value of the given pin in port1 as Low
			}
			break ;
		
		case 2 :		
			if(outputvalue==1)
			{
				SET_BIT(P2,pinnumber);//Set the value of the given pin in port2 as High
			}
			else
			{
				CLR_BIT(P2,pinnumber);//Set the value of the given pin in port2 as Low
			}
			break ;
		
		case 3:
			if(outputvalue==1)
			{
				SET_BIT(P3,pinnumber);//Set the value of the given pin in port3 as High
			}
			else
			{
				CLR_BIT(P3,pinnumber);//Set the value of the given pin in port3 as Low
			}
			break ;
		default: break ;
	}
}

void DIO_setPinInput(unsigned char portnumber,unsigned char pinnumber,unsigned char direction)
{
	switch(portnumber)
		{
		case 0:
			// make the pin as input pin
			CLR_BIT(P0MDOUT,pinnumber);//Set the output mode of pinNumber of port0 to Open-Drain mode
			SET_BIT(P0,pinnumber); //Set the value of the given pin in port0 as High
			break;

		case 1:	
			// make the pin as input pin
			CLR_BIT(P1MDOUT,pinnumber);//Set the output mode of pinNumber of port1 to Open-Drain mode
			SET_BIT(P1,pinnumber); //Set the value of the given pin in port1 as High
			if(direction==1)
			{
				SET_BIT(P1MDIN,pinnumber); //Pin is configured in Analog Input mode.
			}
			else
			{
				 CLR_BIT(P1MDIN,pinnumber); //Pin is configured in Analog Input mode.
			}
			break;
		case 2:
			// make the pin as input pin
			CLR_BIT(P2MDOUT,pinnumber);//Set the output mode of pinNumber of port2 to Open-Drain mode
			SET_BIT(P2,pinnumber); //Set the value of the given pin in port2 as High
			break;
			
		case 3:
			// make the pin as input pin
			CLR_BIT(P3MDOUT,pinnumber);//Set the output mode of pinNumber of port3 to Open-Drain mode
			SET_BIT(P3,pinnumber); //Set the value of the given pin in port3 as High
			break;
		
	}
	
}


unsigned char DIO_pinRead(unsigned char portnumber,unsigned char pinnumber)
{
	unsigned char return_value=0;
	switch(portnumber)
	{
		case 0 :
		return_value=READ_BIT(P0,pinnumber);//Read the value from the given pin in port A
		break;
		
		case 1 :
		return_value=READ_BIT(P1,pinnumber);//Read the value from the given pin in port B
		break;
		
		case 2:
		return_value=READ_BIT(P2,pinnumber);//Read the value from the given pin in port C
		break;
		
		case 3 :
		return_value=READ_BIT(P3,pinnumber);//Read the value from the given pin in port D
		break;
		default: 
		break;
	}
	return return_value ;
}




void write_low_nibble(unsigned char portnumber,unsigned char value)
{
	value&=0x0f;
	switch(portnumber)
	{
		case 0:
		P0 &=0xf0;
		P0|=value;
		break;
		
		case 1:
		P1 &=0xf0;
		P1|=value;
		break;
		
		case 2:
		P2 &=0xf0;
		P2 |=value;
		break;
		
		case 3:
		P3 &=0xf0;
		P3 |=value;
		break;
	}
}

void write_high_nibble(unsigned char portnumber,unsigned char value)
{
	value<<=4;
	switch(portnumber)
	{
		case 0:
		P0 &=0x0f;
		P0 |=value;
		break;
		
		case 1:
		P1 &=0x0f;
		P1 |=value;
		break;
		
		case 2:
		P2 &=0x0f;
		P2 |=value;
		break;
		
		case 3:
		P3 &=0x0f;
		P3 |=value;
		break;
	}
}

void DIO_setPort_OutPutMode(unsigned char portnumber,unsigned char direction)
{
	switch(portnumber)
	{
		case 0:
		if(direction==1)
		{
			P0MDOUT |= 0xff;//Set the output mode of port0 to Push-Pull mode
		}
		else
		{
			P0MDOUT &= 0x00;//Set the output mode of port0 to Open-Drain mode
		}
		break;
		case 1:
		if(direction==1)
		{
			P1MDOUT |= 0xff;//Set the output mode of port1 to Push-Pull mode
		}
		else
		{
			P1MDOUT &= 0x00;//Set the output mode of port1 to Open-Drain mode
		}
		break;
		case 2:
		if(direction==1)
		{
			P2MDOUT |= 0xff;//Set the output mode of port2 to Push-Pull mode
		}
		else
		{
			P2MDOUT &= 0x00;//Set the output mode of port2 to Open-Drain mode
		}
		break;
		case 3:
		if(direction==1)
		{
			P3MDOUT |= 0xff;//Set the output mode of port3 to Push-Pull mode
		}
		else
		{
			P3MDOUT &= 0x00;//Set the output mode of port3 to Open-Drain mode
		}
		break;
		default: 
		break;
	}
	
}

void DIO_setPortInput(unsigned char portnumber)
{
	switch(portnumber)
		{
		case 0:
			// make the pin as input pin
			DIO_setPort_OutPutMode(0,0);//Set the output mode of pinNumber of port0 to Open-Drain mode
			DIO_write_port(0,0xff); //Set the value of the given pin in port0 as High
			break;

		case 1:	
			// make the pin as input pin
			DIO_setPort_OutPutMode(1,0);//Set the output mode of pinNumber of port1 to Open-Drain mode
			DIO_write_port(1,0xff); //Set the value of the given pin in port1 as High
			break;
		case 2:
			// make the pin as input pin
			DIO_setPort_OutPutMode(2,0);//Set the output mode of pinNumber of port2 to Open-Drain mode
			DIO_write_port(2,0xff); //Set the value of the given pin in port2 as High
			break;
			
		case 3:
			// make the pin as input pin
			DIO_setPort_OutPutMode(3,0);//Set the output mode of pinNumber of port3 to Open-Drain mode
			DIO_write_port(0,0xff); //Set the value of the given pin in port3 as High
			break;
		
	}
	
}


unsigned char DIO_read_port(unsigned char portnumber)
{
	unsigned char return_val=0;
	switch(portnumber)
	{
		case 0 :
		return_val=P0; // read the value of port A 
		break ;
		case 1:
		return_val=P1; // read the value of port B 
		break ;
		case 2 :
		return_val=P2; // read the value of port C 
		break ;
		case 3:
		return_val=P3; // read the value of port D 
		break ;
		default:
		break ;
	}
	return return_val;
}

void DIO_write_port(unsigned char portnumber,unsigned char portvalue)
{
	switch(portnumber)
	{
		case 0 :
			P0 = portvalue; //Write the given value to the port A
			break ;
		
		case 1:
			P1 = portvalue; //Write the given value to the port B
			break ;
		
		case 2 :
			P2 = portvalue; //Write the given value to the port C
			break ;
		
		case 3:
			P3 = portvalue; //Write the given value to the port D
			break ;
		
		default:
		 break ;
	}
}



void DIO_toggle(unsigned char portnumber,unsigned char pinnumber)
{
	switch(portnumber)
	{
		case 0:
			TOG_BIT(P0,pinnumber);//Toggle the value of the given pin in port A
			break;
		
		case 1:
			TOG_BIT(P1,pinnumber);//Toggle the value of the given pin in port B
			break;
		
		case 2:
			TOG_BIT(P2,pinnumber);//Toggle the value of the given pin in port C
			break;
		
		case 3:
			TOG_BIT(P3,pinnumber);//Toggle the value of the given pin in port D
			break;
		
		default: break;
	}
}



void delay_ms(unsigned int k)
{
  unsigned int i,j;
     for(i=0;i<=k;i++)
	    for(j=0;j<110;j++);
}

void interrupt_enable(void)
{
		SET_BIT(IE,7);
}

void interrupt_0Enable(void)
{
	SET_BIT(IE,0);
	SET_BIT(TCON,0);
}
void interrupt_1Enable(void)
{
	SET_BIT(IE,2);
	SET_BIT(TCON,2);
}


void initTimer1(void)
{
	
		SET_BIT(TMOD,4);       //Timer1 mode 1 
    TH1 = 0X00;        //Load the timer value
    TL1 = 0X00;
    TR1 = 1;           //turn ON Timer one
    ET1 = 1;           //Enable TImer1 Interrupt
    EA = 1;            //Enable Global Interrupt 
}

void initTimer0(void)
{
		CKCON |= 0x04; //T0M = 1; Timer 0 uses SysClock

		SET_BIT(TMOD,1);       //Timer0 mode 1 
    TH0 = 0XFD;        //Load the timer value
    TL0 = 0XFD;
    TR0 = 1;           //turn ON Timer zero
    ET0 = 1;           //Enable TImer0 Interrupt
    EA = 1;            //Enable Global Interrupt 
	

}


